package main

import (
	f "fmt"
)

//การเข้าถึงสมาชิกของ slice
/*สามารถเข้าถึงสมาชิกเฉพาะของ slice ได้โดยการอ้างถึง
หมายเลขดัชนี (index number)
*/
/*ใน Go ดัชนีเริ่มต้นที่ 0 หมายความว่า
[0] เป็นสมาชิกแรก, [1] เป็นสมาชิกที่สอง
*/
//วิธีการเข้าถึงสมาชิกแรกและสมาชิกที่สามใน slice ชื่อ prices
func main() {

	prices := []int{10, 20, 30}
	f.Println(prices[0]) //การเข้าถึงค่าข้อมูลของ
	f.Println(prices[2])
}

/*
- ประกาศ slice ชื่อ prices ที่มี 3 สมาชิก
- กำหนดค่าข้อมูลสมาชิก 10 20 30
- กำหนดชนิดข้อมูลสมาชิก int
- prices [0] เข้าถึงและพิมพ์สมาชิกตัวแรก คือ 10
- prices [2] เข้าถึงและพิมสมาชิกตัวที่สาม คือ 30
ฟังก์ชัน println การเพิ่มบรรทัดใหม่ (newline) หลังจากพิมพ์ข้อความเสร็จ
*/
/* 1.การประกาศ slice
prices := []int{10,20,30}
ประกาศ slice ชื่อ prices ที่มีประเภทข้อมูลเป็น int และ
มีค่าเริ่มต้นเป็น 10 20 และ 30

   2.การเข้าถึงและพิมพ์สมาชิก
f.Println(prices[0])
เข้าถึงสมาชิกแรกของ prices (ดัชนี 0) ซึ่งมีค่าเป็น 10 และพิมพ์ออกมา
f.Println(prices[2])
เข้าถึงสมาชิกที่สามของ prices (ดัชนี 3) ซึ่งมีค่าเป็น 30 และพิมพ์ออกมา
*/
/*การเข้าถึงสมาชิกของ slice ใน Go ทำได้ง่ายและสะดวก
เพียงแค่ระบุหมายเลขดัชนีของสมาชิกที่ต้องการ
*/
