package main

import (
	f "fmt"
)

//การเข้าถึงสมาชิกของ Map ในภาษา Go
/*เราสามารถเข้าถึงสมาชิกของแผนที่ (Map) ได้โดยใช้คีย์ของ
map เพื่อดึงค่าที่ต้องการ
*/
/* Syntax
value = map_name[key]
map_name คือชื่อของ map
key คือคีย์ที่ต้องการใช้เพื่อดึงค่าจากแผนที่
value คือค่าที่ถูกดึงออกมาจากแผนที่ด้วยคีย์ที่กำหนด
*/
//ใช้ฟังก์ชัน make เพื่อสร้าง map empty ชื่อ a ที่มีคีย์เป็นชนิด string และค่าก็เป็นชนิด string
var a = make(map[string]string)

func main() {
	//การเพิ่มคีย์และค่าเข้าไปใน map
	a["brand"] = "Ford"
	a["model"] = "Mustang"
	a["year"] = "1964"
	/*ใช้คีย์เพื่อเพิ่มค่าลงใน map ตัวอย่างเช่น a["brand"] = "Ford" จะเพิ่มคีย์ "brand" และค่าของมันคือ "Ford"
	 */
	f.Printf(a["brand"]) //เข้าถึงสมาชิกและพิมพ์ค่าของคีย์ "brand"
	//ใช้คีย์ "brand" เพื่อเข้าถึงค่าใน map และพิมพ์ค่าที่ได้ออกมา ซึ่งในกรณีนี้คือ "Ford"
}

/* Note:
การเข้าถึงค่าจากแผนที่โดยใช้คีย์เป็นสิ่งที่มีประสิทธิภาพสูงเนื่องจาก map ใน Go ใช้การจัด
เก็บข้อมูลแบบตารางแฮช (hash table) ซึ่งสามารถค้นหาคีย์ได้อย่างรวดเร็ว
การเข้าถึงสมาชิกของ map ใน Go จึงเป็นเรื่องง่ายและมี ประสิทธิภาพสูง
ด้วยการใช้คีย์ในการดึงค่าที่ต้องการ
*/
