package main

/* รายการของตัวดำเนินการ การกำหนดค่า (Assignent Operators)
ตัวดำเนินการ การกำหนดค่าใช้สำหรับกำหนดค่าให้กับตัวแปรตาม
การดำเนินการที่ต้องการ

Operator	 Example	   Same As		   Description
   =		 x = 5		x = 5		     กำหนดค่า 5 ให้กับ x
  x=		 x += 3     x = x + 3     เพิ่มค่า 3 ให้กับ x
  -=      x -= 3     x = x - 3	  ลดค่า 3 จาก x
  *=		 x *= 3		x = x * 3 	  คูณ x ด้วย 3
  /= 		 x /= 3     x = x / 3     หาร x ด้วย 3
  %= 		 x %= 3     x = x % 3     หาร x ด้วย 3 แล้วเอาเศษ
  &=		 x &= 3     x = x & 3     And bitwise ของ x และ 3
	         =			  x 		 	       = 3
  ^=		 x ^= 3		x = x ^ 3	  XOR bitwise ของ x และ 3
 >>=		 x >>= 3	   x = x >> 3 	  Shift ขวา bitwise ของ x ด้วย 3 บิต
 <<=		 x <<= 3	   x = x << 3	  Shift ซ้าย bitwise ของ x ด้วย 3 บิต

อธิบาย

การกำหนดค่า (=)
กำหนดค่าให้กับตัวแปรโดยตรง

การบวกและกำหนดค่า (+=)
เพิ่มค่าให้กับตัวแปร

การลบและกำหนดค่า (-=)
ลดค่าจากตัวแปร

การคูณและกำหนดค่า (*=)
คูณค่ากับตัวแปร

การหารและกำหนดค่า (/=)
หารค่ากับตัวแปร

การหารเอาเศษและกำหนดค่า (%=)
หารค่ากับตัวแปรแล้วเอาเศษ

การ AND bitwise และกำหนดค่า (&=)
AND bitwise กับตัวแปร

การ OR bitwise และกำหนดค่า (|=)
OR bitwise กับตัวแปร

การ Shift ขวา bitwise และกำหนดค่า (>>=)
Shift ขวา bitwise กับตัวแปร

การ shift ซ้าย bitwise และกำหนดค่า (<<=)
Shift ซ้าย bitwise กับตัวแปร
*/
