package main

import (
	f "fmt"
)

// การใช้งานเวิร์บการจัดรูปแบบสำหรับข้อมูลชนิดจำนวนเต็ม
// (Integer Formatting Verbs) ใน Go
var i = 15

func main() {
	//ฟังก์ชัน Printf() ใช้สำหรับการจัดรูปแบบ (format) อาร์กิวเมนต์
	//ตามการกำหนดรูปแบบ (formatting verb) ที่กำหนดไว้

	// พิมพ์เลขฐาน 2 (binary)
	f.Printf("%b\n", i) // 1111
	// พิมพ์เลขฐาน 10 (decimal)
	f.Printf("%d\n", i) // 15
	// พิมพ์เลขฐาน 10 และแสดงเสมอเครื่องหมายบวกหรือลบ
	f.Printf("%+d\n", i) // +15
	// พิมพ์เลขฐาน 8 (octal)
	f.Printf("%o\n", i) // 17
	// พิมพ์เลขฐาน 8 พร้อมตัวอักษร 0o ข้างหน้า
	f.Printf("%O\n", i) // 0o17
	// พิมพ์เลขฐาน 16 ตัวพิมพ์เล็ก (hexadecimal lowercase)
	f.Printf("%x\n", i) // f
	// พิมพ์เลขฐาน 16 ตัวพิมพ์ใหญ่ (hexadecimal uppercase)
	f.Printf("%X\n", i) // F
	// พิมพ์เลขฐาน 16 พร้อมตัวอักษร 0x ข้างหน้า
	f.Printf("%#x\n", i) // 0xf
	// จัดขยายด้วยช่องว่าง (ความกว้าง 5 ตัวอักษร, จัดตำแหน่งทางขวา)
	f.Printf("%4d\n", i) //  15
	// จัดขยายด้วยช่องว่าง (ความกว้าง 5 ตัวอักษร, จัดตำแหน่งทางซ้าย)
	f.Printf("%-4d\n", i) // 15
	// จัดขยายด้วยเลข 0 (ความกว้าง 5 ตัวอักษร, จัดตำแหน่งด้วยเลข 0)
	f.Printf("%04d\n", i) //0015
}
