package main

import (
	f "fmt"
)

// การลบสมาชิกใน map ของภาษา Go
/* การลบสมาชิกออกจากแผนที่สามารภทำได้โดย
ใช้ฟังก์ชัน delete
*/
/* Syntax
delete(map_name, key)
map_name คือ ชื่อของ map ที่ต้องการลบสมาชิกออก
key คือ คีย์ของสมาชิกที่ต้องการลบ
*/
// ประกาศฟังก์ชัน make() เพื่อสร้าง map empty ชื่อ a ชนิดข้อมูล string:string
var a = make(map[string]string)

func main() {
	//การเพิ่มคีย์และค่าเข้าไปใน map
	a["brand"] = "Ford"
	a["model"] = "Mustang"
	a["year"] = "1964"
	f.Println(a) // พิมพ์ผลลัพธ์ออกจอภาพ

	delete(a, "year") //ประกาศฟังก์ชัน delete() พร้อมระบุตัวแปร a และกำหนดคีย์ที่จะลบ ซึ่งคือ year
	f.Println(a)      //พิมพ์ผลลัพธ์ตัวแปร a หลังจากลบคีย์ year ออกจอภาพ
}

/* Note:
การลบสมาชิกออกจาก map โดยใช้ฟังก์ชัน delete
และระบุคีย์ของสมาชิกที่ต้องการลบ
หลังจากที่ลบสมาชิกแล้ว
คีย์และค่าของสมาชิกนั้นจะถูกลบออกจาก map ทันที
การลบสมาชิกที่ไม่มีอยู่ใน map จะไม่มีผลอะไร
*/
/*  สรุป
การใช้ฟังก์ชัน delete ใน Go
ช่วยให้การจัดการข้อมูลใน map มีความยืดหยุ่นมากขึ้น
สามารถเพิ่ม, อัปเดต, และลบสมาชิกได้ตามต้องการ
*/
