package main

import (
	f "fmt"
)

// ตัวดำเนินการบวกและกำหนดค่า (Addition Assignment Operator, += )
// ตัวดำเนินการบวกและกำหนดค่า (+=) ใช้เพื่อเพิ่มค่าให้กับตัวแปร ที่มีอยู่แล้ว
// การใช้ตัวดำเนินการบวกและกำหนดค่า (+=) เพื่อเพิ่มค่า 5 ให้กับตัวแปร x ที่มีค่าเริ่มต้นเป็น 10
var x = 10 //กำหนดค่าเริ่มต้นให้กับตัวแปร x เป็น 10
func main() {
	x += 5       // เพิ่มค่า 5 ให้กับตัวแปร x (x = x + 5)
	f.Println(x) //แสดงผลค่าของ x ซึ่งจะเป็น 15
}

/*Note สิ่งที่ควรจำ
- ตัวดำเนินการ += เป็นวิธีที่สะดวกในการเพิ่มค่าให้กับตัวแปรโดย
ไม่ต้องใช้ตัวดำเนินการ + และตัวดำเนินการ การกำหนดค่า = แยกกัน
- สามารถใช้ตัวดำเนินการ += กับตัวแปรชนิดตัวเลขต่างๆ เช่น int, float64
*/
