package main

/*
ค่าคงที่ใน Go
เป็นค่าที่ถูกกำหนดขึ้นเมื่อประกาศและไม่สามารถเปลี่ยนแปลงได้ในภายหลัง
ทำให้ค่าคงที่เป็นแบบอ่านอย่างเดียว
*/
import (
	f "fmt"
)

// ค่าคงที่จะต้องถูกกำหนดค่าเมื่อประกาศและ
// ค่าของมันจะไม่สามารถเปลี่ยนแปลงได้ในภายหลัง
func main() {
	const A = 1 //บรรทัดนี้ประกาศค่าคงที่ชื่อ A และกำหนดค่าเริ่มต้นให้เป็น 1
	A = 2       // บรรทัดนี้จะทำให้เกิดข้อผิดพลาดในการคอมไพล์
	f.Println(A)
}

/*
เมื่อคอมไพล์โค้ดนี้ Go
จะแสดงข้อผิดพลาดว่าไม่สามารถกำหนดค่าให้กับ A ได้
เนื่องจาก A เป็นค่าคงที่ที่ถูกกำหนดไว้แล้ว
*/
//ผลลัพธ์ ./prog.go:8:7: cannot assign to A
