package main

/*ตัวดำเนินการทางบิต (Bitwise Operators)
ตัวดำเนินการทางบิตใช้กับตัวเลขแบบไบนารี (binary numbers)
Operator 		Name 					Description 						   											Example
&				AND						ตั้งค่าแต่ละบิตเป็น 1 หากทั้งสองบิตเป็น 1        		   								  x & y
|				OR						ตั้งค่าแต่ละบิตเป็น 1 ถ้าหนึ่งในสองบิตเป็น 1	  											x | y
^				XOR(Exclusive OR)		ตั้งค่าแต่ละบิตเป็น 1 หากมีบิตเพียงหนึ่งบิตเป็น 1			  								  x ^ b
<<				zero fill left shift	การเลื่อนตำแหน่งไปทางซ้ายโดยใส่เลข 0 เข้ามาจากขวา										 x << 2
>>				Signed right shift		การเลื่อนตำแหน่งไปทางขวาโดยใส่สำเนาของบิตทางซ้ายสุดเข้ามจากซ้ายและปล่อยบิตทางขวาสุดลงมา		 x >> 2

ตัวดำเนินการทางบิตเหล่านี้ทำงานโดยการประมวลผลบิตในตัวเลขแบบไบนารี ซึ่งใช้
กันมากในการจัดการกับข้อมูลที่ระดับบิตในการเขียนโปรแกรมที่ต้องการควบคุมการเข้าถึงบิตของข้อมูลที่ละเอียด



*/
