package main

//คำสั่งเงื่อนไข (Conditional Statements)
//คำสั่งเงื่อนไขใช้ในการดำเนินการที่แตกต่างกันตามเงื่อนไขที่แตกต่างกัน
/*เงื่อนไขในภาษา Go (Go Conditions)
เงื่อนไขสามารถเป็น จริง (true) หรือ เท็จ (false) ได้

ภาษา Go รองรับตัวดำเนินการเปรียบเทียบที่ใช้กันในคณิตศาสตร์

		น้อยกว่า <
		น้อยกว่าเท่ากับ <=
		มากกว่า >
		มากกว่าหรือเท่ากับ >=
		เท่ากับ ==
		ไม่เท่ากับ !=
*/
/*นอกจากนี้ ภาษา Go ยังรองรับตัวดำเนินการตรรกะที่ใช้กันทั่วไป

		AND เชิงตรรกะ &&
		OR  เชิงตรรกะ ||
		NOT เชิงตรรกะ !

เราสามารถใช้ตัวดำเนินการเหล่านี้หรือการรวมกันของมัน
เพื่อสร้างเงื่อนไขสำหรับการตัดสินใจที่แตกต่าง
*/
/*
x > y ตรวจสอบว่า x มากกว่า y
x != y ตรวจสอบว่า x ไม่เท่ากับ y
(x > y) && (y > z) ตรวจสอบว่า x มากกว่า y และ y มากกว่า z
(x == y)||z ตรวจสอบว่า x เท่ากับ y หรือ z เป็นจริง
*/
/*
คำสั่งเงื่อนไข (Conditional Statements)ใน Go
*ใช้ if เพื่อระบุบล็อกของโค้ดที่จะถูกดำเนินการ หากเงื่อนไขที่กำหนดเป็นจริง

*Syntax if condition{
	คำสั่งที่จะดำเนินการหากเงื่อนไขเป็นจริง
}

*ใช้ else เพื่อระบุบล็อกของโค้ดที่จะถูกดำเนินการ หากเงื่อนไขเดียวกันนั้นเป็นเท็จ
*Syntax if condition{
	คำสั่งที่จะดำเนินการหากเงื่อนไขเป็นจริง
}
	else{
	คำสั่งที่จะดำเนินการหากเงื่อนไขเป็นเท็จ
	}

*ใช้ else if เพื่อระบุเงื่อนไขใหม่ที่จะตรวจสอบ หากเงื่อนไขแรกเป็นเท็จ
*Syntax if condition1{
	คำสั่งที่จะดำเนินการหากเงื่อนไขที่ 1 เป็น จริง
}
	else if condition2{
	คำสั่งที่จะดำเนินการหากเงื่อนไขที่ 2 เป็น จริง
	}
	else{
	คำสั่งที่จะดำเนินการหากเงื่อนไขที่ 1 เงื่อนไขที่ 2 เป็นเท็จ
	}
*ใช้ switch เพื่อระบุบล็อกโค้ดหลายบล็อกที่สามารถถูกดำเนินการได้

*Syntax switch expression {
case value1:
	บล็อกโค้ดที่จะถูกดำเนินการเมื่อ expression เท่ากับ value1
case value2:
	บล็อกโค้ดที่จะถูกดำเนินการเมื่อ expression เท่ากับ value1
default:
	บล็อกโค้ดที่จะถูกดำเนินการเมื่อไม่มีกรณีใดๆ ที่ตรงกับ expression
	}
*/
