package main //ประกาศ package หลัก ไฟล์นี้เป็น package หลักของโปรแกรม

import (
	f "fmt" //นำเข้าแพ็กเกจ fmt ซึ่งใช้สำหรับการจัดการการแสดงผลและการพิมพ์ค่าใน Go
)

/*ในภาษา Go หาก array หรือสมาชิกใน array ไม่ได้รับ
การกำหนดค่าเริ่มต้นในโค้ด ค่านั้นจะถูกกำหนดเป็นค่าพื้นฐานของ
ชนิดข้อมูลนั้นๆโดยอัตโนมัติ เช่น ค่าเริ่มต้นของ int คือ 0 และ
ค่าเริ่มต้นของ string คือ ""(สตริงว่าง)
*/
//ฟังก์ชันหลัก
func main() {
	arr1 := [5]int{}              //ไม่ได้กำหนดค่าเริ่มต้น
	arr2 := [5]int{1, 2}          //กำหนดค่าเริ่มต้นบางส่วน
	arr3 := [5]int{1, 2, 3, 4, 5} //กำหนดค่าเริ่มต้นทั้งหมด
	f.Println(arr1)               //พิมพ์ค่าใน arr1
	f.Println(arr2)               //พิมพ์ค่าใน arr2
	f.Println(arr3)               //พิมพ์ค่าใน arr3
}

/*สรุป
การกำหนดค่าเริ่มต้นให้กับ array ใน Go สามาถทำได้ทั้งการกำหนดค่าเริ่มต้นบาง
ส่วนหรือทั้งหมด ถ้าไม่ได้กำหนดค่าเริ่มต้น ค่าสมาชิกทั้งหมดจะเป็นค่าพื้นฐานของชนิดข้อมูลนั้นๆ
ซึ่งช่วยให้เรามั่นใจได้ว่า array จะมีค่าที่ถูกต้องเสมอแม้จะไม่ได้กำหนดค่าเริ่มต้น
*/
