package main

import (
	f "fmt"
)

/*
ในภาษา Go เราสามารถหาความยาวของ array ได้โดย
ใช้ฟังก์ชัน len() ฟังก์ชันนี้จะคืนค่าความยาวของ array ซึ่งคือ
จำนวนสมาชิกทั้งหมดใน array นั้น
*/
/*
การใช้ฟังก์ชัน len() เพื่อหาความยาวของ array
ฟังก์ชัน len() ใช้เพื่อหาความยาวของ array โดยการใส่ array
ที่ต้องการหาความยาวภายในวงเล็บของฟังก์ชัน
*/
// len(array_name) Syntax how to use?
func main() {
	// ประกาศและกำหนดค่าเริ่มต้นให้กับ array arr1
	arr1 := [4]string{"iphone", "samsung", "Vivo", "Oppo"}
	// ประกาศและกำหนดค่าเริ่มต้นให้กับ array arr2 โดยให้ Go คำนวณความยาวของ array เอง
	arr2 := [...]int{1, 2, 3, 4, 5, 6}
	f.Println(len(arr1)) // พิมพ์ความยาวของ array arr1
	f.Println(len(arr2)) // พิมพ์คามยาวของ array arr2
}

/*การหาความยาวของ array
f.Println(len(arr1))
ใช้ฟังก์ชัน len() เพื่อหาความยาวของ array
arr1 ซึ่งจะได้ค่าเป็น 4

f.Println(len(arr2))
ใช้ฟังก์ชัน len() เพื่อหาความยาวของ array
arr2 ซึ่งจะได้ค่าเป็น 6
*/
/*สรุป
การหาความยาวของ array ในภาษา Go สามารถทำได้โดยใช้
ฟังก์ชัน len() ซึ่งจะคืนค่าความยาวของ array นั้น การใช้ฟังก์ชันนี้
ช่วยให้เราสามารถตรวจสอบและจัดการกับ array ได้อย่างง่ายดาย
โดยไม่ต้องนับจำนวนสมาชิกเอง
*/
