package main

import (
	f "fmt"
)

//คำสั่ง if ในภาษา Go (Go if statement)
/*การใช้คำสั่ง if ใช้คำสั่ง if เพื่อระบุบล็อกของโค้ดภาษา Go ที่จะถูกดำเนินการถ้าเงื่อนไขเป็นจริง (true)
ในตัวอย่างด้านล่าง เราทดสอบค่าสองค่าเพื่อหาว่า 20 มากกว่า 18 หรือไม่
ถ้าเงื่อนไขเป็นจริงจะแสดงข้อความบางอย่าง */
//*Syntax if condition{ โค้ดที่จะถูกดำเนินการเมื่อเงื่อนไขเป็นจริง }
func main() {
	//
	if 20 > 18 {
		f.Println("20 มากกว่า 18")
	}
}

/* ให้สังเกตว่า if ต้องเขียนด้วยตัวพิมพ์เล็ก หากเขียนด้วยตัวพิมพ์ใหญ่
(เช่น if หรือ IF)จะเกิดข้อผิดพลาด
*/
/*อธิบายโค้ดด้านบน
ในตัวอย่างข้างต้น เราใช้ค่าคงที่ 20 และ 18 เพื่อทดสอบว่า 20 มากกว่า 18 หรือไม่
(โดยใช้ตัวดำเนินการ > ) เมื่อเงื่อนไขเป็นจริง(เนื่องจาก 20 มากกว่า 18)โค้ดในบล็อก if
จึงถูกดำเนินการและแสดงข้อความ "20 มากกว่า 18" บนหน้าจอ

สรุป
นี่เป็นการใช้งานคำสั่ง if แบบพื้นฐานที่สุดในภาษา Go โดยใช้เงื่อไขที่เป็นค่าคงที่ แต่ในกรณีจริงๆ
เราสามารถใช้ตัวแปรหรือการคำนวณต่างๆในเงื่อนไขเพื่อการตัดสินใจที่ซับซ้อนขึ้นได้
*/
