package main

import (
	f "fmt"
)

// break statement
/*
คำสั่ง break ใช้ในการหยุดการทำงานของลูปทันที และออกจากลูปนั้น
*/
/*		Syntax
for statement1; statement2; statement3{
	if condition{
		break
	}
		โค้ดที่จะถูกเรียกใช้ถ้า condition เป็น FALSE
}
*/
/*โค้ดตัวอย่างนี้จะแสดงเลขตั้งแต่ 0 ถึง 4
แต่จะหยุดการทำงานของลูปเมื่อ i เท่ากับ 3
*/
func main() {
	for i := 0; i < 5; i++ {
		if i == 3 {
			break
		}
		f.Println(i)
	}
}

// Note: continue และ break มักจะใช้ร่วมกับ เงื่อนไข (conditions)

/*อธิบายโค้ด
1.for i := 0; i < 5; i++{ เริ่มต้นการวนลูปโดย i
มีค่าเริ่มต้นเป็น 0 และจะเพิ่มค่าทีละ 1 จนถึงน้อยกว่า 5
2.if i == 3 { break } เมื่อ i เท่ากับ 3 คำสั่ง
break จะถูกเรียกใช้ ทำให้การทำงานของลูปหยุดลงและออกจากลูปทันที
3.f.Println(i) จะแสดงค่าของ i ถ้าเงื่อนไข i == 3 เป็นเท็จ
*/
/*สรุป
ซึ่งแสดงให้เห็นว่าเมื่อ i เท่ากับ 3 การทำงานของลูปจะหยุดลง
และค่าที่เป็น 3 จะไม่ถูกแสดง
1.continue และ break ใช้ในการควบคุมการทำงานของลูป
โดยอิงตามเงื่อนไขที่กำหนด
2.continue ใช้เพื่อข้ามรอบการทำงานในลูปไปยังรอบถัดไป
3.break ใช้เพื่อหยุดการทำงานของลูปและออกจากลูปทันที
*/
