package main

import (
	f "fmt"
)

/*ในภาษา Go เราสามารถเข้าถึงสมาชิกใน array ได้โดยใช้ดัชนี (index)
ซึ่งดัชนีของ array ใน Go เริ่มต้นที่ 0 นั่นหมายความว่า
ดัชนี [0] คือสมาชิกตัวแรก [1] คือสมาชิกตัวที่สอง,และต่อไปเรื่อยๆ
*/

/*การเข้าถึงสมาชิกใน Array
เพื่อเข้าถึงสมาชิกใน array ให้ระบุดัชนีของสมาชิกที่ต้องการภายใน
วงเล็บสี่เหลี่ยมหลังชื่อ array ตัวอย่างเช่น array_name[index]
*/
// การเข้าถึงสมาชิกตัวแรกและตัวที่สามใน array prices
func main() {
	prices := [3]int{10, 20, 30}
	f.Println(prices[0]) //เข้าถึงและพิมพ์ค่าของสมาชิกตัวแรกใน array
	f.Println(prices[2]) //เข้าถึงและพิมพ์ค่าของสมาชิกตัวที่สามใน array
}

/*
การเข้าถึงสมาชิกใน array ในภาษา Go ทำได้โดยการระบุดัชนีของ
สมาชิกที่ต้องการในวงเล็บสี่เหลี่ยมหลังชื่อ array ดัชนีเริ่มต้นที่ 0 ทำให้
สมาชิกตัวแรกของ array มีดัชนีเป็น 0 และสมาชิกตัวที่สองมี
ดัชนีเป็น 1 เป็นต้น การเข้าถึงสมาชิกใน array แบบนี้ทำให้เรา
สามารถดึงค่าที่ต้องการมาใช้งานได้อย่างง่าย
*/
