package main

import (
	f "fmt"
)

// การใช้งานฟังก์ชัน defer ในภาษา Go ใช้สำหรับเลื่อนการเรียกใช้งานฟังก์ชัน
func main() {
	defer f.Println("World") // การเรียกใช้ฟังก์ชัน defer จะถูกเลื่อนไปจนกว่าฟังก์ชัน main จะสิ้นสุด
	f.Println("Hello")       // ฟังก์ชัน Println("hello") จะถูกเรียกใช้ก่อน
}

// การทำงานของโค้ด
/*การเรียกใช้งานฟังก์ชัน defer

- เมื่อ defer fmt.Println("world")
ถูกเรียกใช้ฟังก์ชัน fmt.Println("world")
จะถูกตั้งค่าให้ทำงานเมื่อฟังก์ชัน main สิ้นสุด

- พารามิเตอร์ของ fmt.Println("world")
จะถูกประเมิน (evaluated) ทันที แต่การเรียกใช้งานฟังก์ชัน
นั้นจะถูกเลื่อน
การเรียกใช้งานฟังก์ชันหลัก

- ฟังก์ชัน f.Println("hello") จะถูกเรียกใช้ในทันที
และจะพิมพ์ "hello" ออกมา

- การสิ้นสุดการทำงานของฟังก์ชัน main
เมื่อฟังก์ชัน main จะสิ้นสุดการทำงาน,
ฟังก์ชันที่ถูก defer (ในกรณีนี้คือ fmt.Println("world"))จะถูกเรียกใช้
ดังนั้น,"world" จะถูกพิมพ์ออกมาหลังจาก "Hello"
*/
