package main

import (
	f "fmt"
)

/*
การจัดรูปแบบสำหรับข้อมูลชนิด float
(Float Formatting Verbs) ใน Go
*/
var i = 3.141

func main() {

	// พิมพ์ค่าเป็นจุดทศนิยม รูปแบบ e เป็นเลขยกกำลัง Scientific notation
	f.Printf("%e\n", i) //3.141000e+00

	// พิมพ์ค่าเป็น Decimal point จุดทศนิยมโดยไม่มีเลขยกกำลัง
	f.Printf("%f\n", i) //3.141000

	// พิมพ์ค่าเป็นจุดทศนิยม (ความกว้างเริ่มต้นโดยมีความแม่นยำ 2 ตำแหน่งหลังจุดทศนิยม)
	f.Printf("%2.f\n", i) //3

	// พิมพ์ค่าเป็นจุดทศนิยม (ความกว้าง 6 ตำแหน่งทั้งหมดโดยมีความแม่นยำ 2 ตำแหน่งหลังจุดทศนิยม)
	f.Printf("%6.2f\n", i) //   3.14

	// พิมค่าเป็นจุดทศนิยม (แสดงผลเป็นรูปแบบที่เหมาะสม จะแสดงเลขยกกำลังเมื่อจำเป็น)
	f.Printf("%g\n", i) //3.141
}

/*
การใช้งานเวิร์บการจัดรูปแบบสำหรับข้อมูลชนิด float
ช่วยให้เราสามารถกำหนดรูปแบบการแสดงผลของข้อมูลทศนิยมให้เหมาะสมและตรงตามความต้องการได้
*/
