package main

import (
	f "fmt"
)

//การใช้พารามิเตอร์หลายตัว
/*การใช้พารามิเตอร์หลายตัวในฟังก์ชัน
ภายในฟังก์ชัน เราสามารถเพิ่มพารามิเตอร์ได้ตามต้องการ
*/
/* 			Syntax
*func functionName(param1 type, param2 type, param3 type){
 โค้ดที่จะถูกดำเนินการ
}
*/
// ประกาศฟังก์ชันชื่อ familyName() มีพารามิเตอร์ 2 ตัว ชื่อ fname ชนิดข้อมูล string
// และชื่อ age ชนิดข้อมูล int
func familyName(fname string, age int) {
	//ประกาศฟังก์ชัน Println() กำหนดข้อความ "Hi" "year" "Refsnes"
	f.Println("Hi", age, "year", fname, "Refsnes") //พิมพ์ข้อความออกจอภาพ
	// ผลลัพธ์ Hi 3 year Liam Refsnes
	// ผลลัพธ์ Hi 14 year jenny Refsnes
	// ผลลัพธ์ Hi 30 year Anja Refsnes
}
func main() {

	//เรียกใช้งานฟังก์ชัน familyName() กำหนดค่าอากิวเมนต์ชื่อ "Liam" และเป็นตัวเลข 3 ส่งค่าออกไปฟังก์ชัน Println()
	familyName("Liam", 3)

	//เรียกใช้งานฟังก์ชัน familyName() กำหนดค่าอากิวเมนต์ชื่อ "Jenny" และเป็นตัวเลข 14 ส่งค่าออกไปฟังก์ชัน Println()
	familyName("jenny", 14)

	//เรียกใช้งานฟังก์ชัน familyName() กำหนดค่าอากิวเมนต์ชื่อ "Anja" และเป็นตัวเลข 30 ส่งค่าออกไปฟังก์ชัน Println()
	familyName("Anja", 30)
}

/*อธิบายโค้ด
ฟังก์ชัน familyName() มีพารามิเตอร์สองตัว fname ที่เป็น
string และ age ที่เป็น int เมื่อเรียกใช้ฟังก์ชันนี้
เราต้องส่งอากิวเมนต์สองตัวไปด้วยเช่น"Liam" และ 3,
"๋Jenny" และ14,"Anja" และ 30
*/
/*Note
เมื่อทำงานกับพารามิเตอร์หลายตัว การเรียกใช้ฟังก์ชันจะต้องมี
จำนวนอาร์กิวเมนต์เท่ากับจำนวนพารามิเตอร์ที่ฟังก์ชันรับ และต้อง
ส่งอาร์กิวเมนต์ในลำดับเดียวกับที่กำหนดพารามิเตอร์ในฟังก์ชัน
*/
