package main

import (
	f "fmt"
)

//เคล็ดลับ การแสดงเฉพาะค่าหรือดัชนี
/*ในกรณีที่ต้องการแสดงเฉพาะค่า หรือดัชนี สามารถละเว้นอีกค่าหนึ่งได้โดย
ใช้เครื่องหมายขีดล่าง _ แทน
*/
//เราต้องการละเว้นการแสดงดัชนีและแสดงเฉพาะค่า
func main() {
	fruits := [3]string{"iphone", "samsung", "vivo"}
	for _, val := range fruits {
		f.Printf("%v\n", val)
	}
}

/* จดตามความเข้าใจ
ประกาศฟังก์ชัน for ใช้เครื่องหมายขีดล่าง _, เพื่อละเว้นการแสดงค่าดัชนี
และใช้ val เก็บค่าแต่ละตำแหน่งของอาร์เรย์
ใช้ range เพื่อวนซ้ำผ่านอาร์เรย์ ชื่อ fruits
พิมพ์ค่าเริ่มต้นอาร์เรย์ ชื่อ fruits
ผลลัพธ์คือ iphone samsung vivo
*/
/*อธิบายโค้ด
ใช้เครื่องหมาย _ เพื่อบอกให้โปรแกรมละเว้นดัชนีและไม่สนใจค่าที่ดัชนีนั้น
คำสั่ง f.Printf() จะพิมพ์เฉพาะค่าของแต่ละตำแหน่งในอาร์เรย์
*/
/* สรุป
ใช้เครื่องหมาย _ ใน range เพื่อละเว้นดัชนีหรือค่าตามต้องการ
สามารถทำให้โค้ดดูเรียบง่ายและอ่านง่ายขึ้นไปเมื่อไม่ต้องการใช้ค่าทั้งสองอย่าง
เพียงใช้ idx, _
*/
//ตัวแปร idx เก็บดัชนีและตัวแปร val เก็บค่าอาร์เรย์
