package main

import (
	f "fmt"
)

/* continue statement
คำสั่ง continue ใช้ในการข้ามการทำงานของลูปในบางรอบและ
ดำเนินการในรอบถัดไปทันที
*/
/* 			Syntax
for statement1; statement2; statement3{
	if condition {
	continue
	}
	โค้ดที่จะถูกเรียกใช้ถ้า condition เป็น FALSE
}
*/
//โค้ดตัวอย่างนี้จะแสดงเลขตั้งแต่ 0 ถึง 4 ยกเว้น 3
func main() {
	for i := 0; i < 5; i++ {
		if i == 3 {
			continue //break
		}
		f.Println("ข้ามค่าที่ 3 และไปที่รอบถัดไปของการวนลูป", i)
	}
}

/*อธิบายโค้ด
1.for i := 0; i < 5; i++{ เริ่มต้นการวนลูบโดย i
มีค่าเริ่มต้นเป็น 0 และจะเพิ่มค่าทีละ 1 จนถึงน้อยกว่า 5
2.if i == 3 { continue } เมื่อ i เท่ากับ 3 คำสั่ง
continue จะถูกเรียกใช้ ทำให้ข้ามการทำงานของ f.Println(i) และ
ไปรอบถัดไปของการวนลูปทันที
f.Println(i) จะแสดงค่าของ i ถ้าเงื่อนไข i == 3 เป็นเท็จ
ซึ่งแสดงให้เห็นว่าค่าที่เป็น 3 ถูกข้ามไปตามที่คาดไว้
*/
