package main

import (
	f "fmt"
)

//การใช้คำสั่ง else if ในภาษา Go
//คำสั่ง else if ใช้เพื่อกำหนดเงื่อนไขใหม่เมื่อเงื่อนไขแรกเป็นเท็จ
/* Syntax else if
if condition1{
	โค้ดที่จะถูกดำเนินการเมื่อ condition1 เป็นจริง
} else if condition2 {
	โค้ดที่จะถูกดำเนินการเมื่อ condition1 เป็นเท็จ
	และ condition2 เป็นจริง
} else {
	โค้ดที่จะถูกดำเนินการเมื่อ condition1 และ condition2
	เป็นเท็จทั้งคู่
}
*/
// วิธีใช้คำสั่ง else if ในการตรวจสอบเวลา
// และแสดงข้อความที่เหมาะสมตามเวลา
func main() {
	time := 22
	if time < 10 {
		f.Println("Good Morning.")
	} else if time < 20 {
		f.Println("Good day.")
	} else {
		f.Println("Good evening")
	}
}

/*อธิบายโค้ด
1.ถ้าค่า time น้อยกว่า 10 จะแสดงข้อความ "Good morning."
2.ถ้าค่า time น้อยกว่า 20 จะแสดงข้อความ "Good day."
3.ถ้าค่า time มากกว่าหรือเท่ากับ 20 จะแสดงข้อความ "Good evening."
หากค่า time เป็น 14 โปรแกรมจะแสดง "Good day" เนื่องจากเงื่อนไข
else if เป็นจริง
ตัวอย่างโค้ดนี้
ค่าของ time คือ 22 ซึ่งมากกว่า 10 และมากกว่า 20 ดังนั้น
ทั้งสองเงื่อนไขใน if และ else if เป็นเท็จ เราจึง
เข้าสู่บล็อก else และแสดงข้อความ "Good evening."
*/
/*สรุป
คำสั่ง else if ในภาษา Go ช่วยให้คุณสามารถตรวจสอบ หลายเงื่อนไข
ในลำดับและดำเนินการตามเงื่อนไขที่ตรงกับค่าของตัวแปรได้
*/
