package main

import (
	f "fmt"
)

// การใช้คำสั่ง else if ในภาษา Go
// ถ้าเงื่อนไข condition1 และ condition2 เป็นจริงทั้งคู่
// จะมีเพียงโค้ดสำหรับ condition1 เท่านั้นที่ถูกดำเนินการ
func main() {
	x := 30
	if x >= 10 {
		f.Println("x มากกว่าหรือเท่ากับ 10")
	} else if x > 20 {
		f.Println("x มากกว่า 20")
	} else {
		f.Println("x น้อยกว่า 10")
	}
} //ผลลัพธ์ x มากกว่าหรือเท่ากับ 10
/*อธิบายโค้ด
1.ประกาศตัวแปร x และกำหนดค่าเป็น 30
2.ตรวจสอบเงื่อนไขแรก if x >= 10
เนื่องจาก x มีค่า 30 ซึ่งมากกว่า 10 เงื่อนไขนี้เป็นจริง จึงแสดงข้อความ
"x มากกว่าหรือเท่ากับ 10"
3.เงื่อนไขที่สอง else if x > 20 ไม่ถูกตรวจสอบเพราะเงื่อนไขแรกเป็นจริงแล้ว
4.บล็อก else จะไม่ถูกดำเนินการเนื่องจากเงื่อนไข if เป็นจริง
*/
/*สรุป
คำสั่ง else if ในภาษา Go ใช้เพื่อเพิ่มเงื่อนไขเพิ่มเติมหลัง
จากคำสั่ง if แต่จะดำเนินการเพียงเงื่อนไขแรกที่เป็นจริงเท่านั้น
บล็อก else if และ else จะถูกข้ามหากเงื่อนไขก่อนหน้านี้เป็นจริงแล้ว
*/
/*
ข้อสังเกตเพิ่มเติม
แม้ว่า x จะมีค่า 30 ซึ่งทำให้เงื่อนไข else if x > 20 เป็นจริงด้วย
แต่เนื่องจากเงื่อนไขแรก if x >= 10 เป็นจริงและได้ถูกดำเนินการแล้ว
บล็อก else if และ else จึงไม่ถูกดำเนินการ
*/
