package main

import (
	f "fmt"
)

/*ในภาษา Go เราจะประกาศและใช้งาน array ที่เก็บค่าของประเภท
string ซึ่งประกอบด้วยชื่อยี่ห้อรถยนต์ ต่อไปนี้เป็นรายละเอียดและ
การอธิบายทีละขั้นตอน
*/
//การประกาศ Array ของ Strings
var telephone = [4]string{"iphone", "samsung", "vivo", "Oppo"}

func main() {
	//Print ใช้แสดงผลข้อความตามรูปแบบเริ่มต้นที่ถูกส่งค่าเข้าไป
	f.Print(telephone) // ผลลัพธ์ [iphone samsung vivo Oppo]
}

/*
	สรุป
ตัวอย่างนี้แสดงการประกาศและการใช้งาน array ของ string
ในภาษา Go โดยการกำหนดความยาวของ array และ
กำหนดค่าที่จะเก็บใน array ตั้งแต่เริ่มต้น การใช้ array ทำให้
เราสามารถจัดเก็บค่าหลายค่าในตัวแปรเดียวกันและเข้าถึงค่าต่าง ๆ
ได้โดยใช้ดัชนี (index)
*/
