package main

import (
	f "fmt"
)

// เลือกประเภทจำนวนเต็มแบบใดดี?
// การเลือกประเภทของจำนวนเต็มขึ้นอยู่กับค่าที่ตัวแปรนั้นจะเก็บ
// อยู่นอกช่วงของ int8 (ซึ่งอยู่ในช่วง -128 ถึง 127):
func main() {
	var x int8 = 1000 //ตัวอย่างนี้จะเกิดข้อผิดพลาดเนื่องจากค่า 1000
	var a int16 = 1000
	var b uint8 = 255
	f.Printf("Type: %T, value: %v\n", x, x)
	f.Printf("Type: %T, value: %v\n", a, a)
	f.Printf("Type: %T, value: %v\n", b, b)
}

/*
เราได้ประกาศตัวแปร x เป็นชนิด int8 และกำหนดค่า 1000 ให้กับมัน
ซึ่งอยู่เกินช่วงที่ int8 สามารถเก็บได้
ทำให้เกิดข้อผิดพลาด "constant 1000 overflows int8"
*/
/*
ข้อแนะนำในการเลือกประเภทจำนวนเต็ม:
ช่วงค่า: เลือกชนิดข้อมูลที่สามารถเก็บค่าที่ต้องการได้ ตัวอย่างเช่น หากค่าที่ต้องการเก็บอยู่ในช่วง 0 ถึง 255 ควรใช้ uint8
ขนาด: เลือกชนิดข้อมูลที่ใช้หน่วยความจำน้อยที่สุดที่สามารถเก็บค่าที่ต้องการได้ ตัวอย่างเช่น หากค่าที่ต้องการเก็บอยู่ในช่วง -32768 ถึง 32767 ควรใช้ int16
ประสิทธิภาพ: ในบางกรณี การใช้ int หรือ uint อาจจะมีประสิทธิภาพมากกว่าเพราะเป็นขนาดที่เหมาะสมกับสถาปัตยกรรมของระบบ
*/
