package main

import (
	f "fmt"
)

// กาประกาศและใช้งาน Arrays ใน Go
// จะกำหนดขนาดและชนิดของข้อมูลที่ array นั้นจะเก็บ
var arr1 = [5]int{1, 2, 3, 4, 5}    //กำหนดขนาดข้อมูลของ array
var arr2 = [...]int{6, 7, 8, 9, 10} // Go คำนวณขนาดข้อมูลของ array จากจำนวนค่าที่กำหนดเอง
var arr = [5]int{11, 12, 13, 14, 15}
var arr6 = [5]int{16, 17, 18, 19, 20}

func main() {
	//การเข้าถึงค่าใน Array
	//สามารถเข้าถึงค่าใน array โดยใช้ดัชนี (index) ซึ่งเริ่มต้นจาก 0
	f.Println(arr1[0]) //พิมพ์ค่า 1
	f.Println(arr2[4]) // พิมพ์ค่า 10

	//การเปลี่ยนแปลงค่าใน Array
	//สามารถเปลี่ยนแปลงค่าใน array โดยใช้ดัชนี
	arr[0] = 20
	f.Println(arr[0]) //พิมพ์ค่า 20

	//การวนลูปผ่าน Array
	//สามารถใช้ for loop เพื่อวนลูปผ่านค่าทั้งหมดใน array
	for i := 0; i < len(arr6); i++ {
		f.Println(arr6[i])
	} //for index := 0; index < len(ตัวแปร array ที่เราสร้าง); i++ เพิ่มค่าของ i ขึ้นทีละ 1 หลังจากรอบของลูปเสร็จสิ้น
	//i < len(arr): เงื่อนไขที่ใช้ในการตรวจสอบว่าลูปควรจะทำงานต่อหรือไม่ ถ้า i น้อยกว่าความยาวของ array (arr) ลูปจะทำงานต่อ
}

/*
ในภาษา Go (Golang) array ถูกใช้เพื่อเก็บค่าหลายค่าในตัวแปรเดียวกัน
โดยค่าทั้งหมดจะต้องมีชนิดข้อมูลเดียวกัน นี่เป็นวิธีที่ทำให้เราไม่ต้องประกาศตัวแปรแยกสำหรับแต่ละค่า
*/
