package main

import (
	f "fmt"
)

// Verbs การจัดรูปแบบใน Go
// Go มีการจัดรูปแบบที่หลากหลายที่สามารถใช้ร่วมกับฟังก์ชัน Printf() ได้
// ซึ่งเรียกว่า "formatting verbs"
/* General Formatting Verbs
เวิร์บการจัดรูปแบบต่อไปนี้สามารถใช้ได้กับทุกประเภทของข้อมูล:
%v	พิมพ์ค่าด้วยรูปแบบเริ่มต้น
%#v	พิมพ์ค่าด้วยรูปแบบไวยากรณ์ของ Go
%T	พิมพ์ชนิดของค่า
%%	พิมพ์เครื่องหมาย %
*/
var i = 15.5
var txt = "Hello Dev!"

// การใช้ฟังก์ชัน fmt.Printf() พร้อมกับเวิร์บการจัดรูปแบบ:
func main() {
	f.Printf("%v\n", i)   //พิมพ์ค่า i ในรูปแบบเริ่มต้น
	f.Printf("%#v\n", i)  //พิมพ์ค่า i ในรูปแบบไวยากณ์ของ Go
	f.Printf("%v%%\n", i) //พิมพ์ค่า i ตามด้วยเครื่องหมาย %
	f.Printf("%T\n", i)   //พิมพ์ชนิดของตัวแปร i

	f.Printf("%v\n", txt)  //พิมพ์ค่า txt ในรูปแบบเริ่มต้น
	f.Printf("%#v\n", txt) //พิมพ์ค่า txt ในรูปแบบไวยากรณ์ของ go
	f.Printf("%T\n", txt)  //พิมพ์ชนิดของตัวแปร txt

}
