package main

import (
	f "fmt"
)

// การใช้งานตัวดำเนินการ + ในภาษา Go
// ถึงแม้ว่าตัวดำเนินการ + มักจะใช้สำหรับการบวกค่าต่างๆ เข้าด้วยกัน
// แต่มันยังสามารถใช้สำหรับบวกตัวแปรกับค่า หรือบวกตัวแปรกับตัวแปรอื่นๆ ได้ด้วย
var (
	sum1 = 100 + 50    //150(100+50)
	sum2 = sum1 + 250  // 400 (150 + 250)
	sum3 = sum2 + sum2 // 800 (400 + 400)
)

func main() {
	f.Println(sum3)
}

/* การประกาศตัวแปร sum1
sum1 = 100 + 50
ประกาศตัวแปร sum1 และกำหนดค่าให้กับตัวแปรโดยใช้ตัวดำเนินการ +
เพื่อบวกค่า 100 และ 50 เข้าด้วยกัน ผลลัพธ์คือ 150

การประกาศตัวแปร sum2
sum2 = sum1 + 250
ประกาศตัวแปร sum2 และกำหนดค่าให้กับตัวแปรโดยใช้ตัวดำเนินการ +
เพื่อบวกค่า sum1 กับ 250 เข้าด้วยกัน ผลลัพธ์คือ 400

การประกาศตัวแปร sum3
sum3 = sum2 + sum2
ประกาศตัวแปร sum3 และกำหนดค่าให้กับตัวแปรโดยใช้ตัวดำเนินการ +
เพื่อบวกค่า sum 2 กับ sum 2 เข้าด้วยกัน ผลลัพธ์คือ 800

*/

/* สรุป
ตัวดำเนินการ + ในภาษา Go สามารถใช้สำหรับกาบวกค่าหลายรูปแบบ เช่น
การบวกค่าคงที่เข้าด้วยกัน การบวกค่าของตัวแปรกับค่าคงที่ และการบวกค่าของตัวแปร
กับตัวแปรอื่นๆ นอกจากนี้มันยังช่วยให้การคำนวณและการจัดการค่าต่างๆ ในโปรแกรมเป็น
ไปอย่างง่ายดายและยืดหยุ่น
*/
