package main

import (
	f "fmt"
)

//คำสั่ง if else ในภาษา Go (Go if else Statement)
/*การใช้คำสั่ง else
ใช้คำสั่ง else เพื่อระบุบล็อกของโค้ดที่จะถูกดำเนินการเมื่อ
เงื่อนไขเป็นเท็จ (false)
Syntax if condition {
	โค้ดที่จะถูกดำเนินการเมื่อเงื่อนไขเป็นจริง
} else{
	โค้ดที่จะถูกดำเนินการเมื่อเงื่อนไขเป็นเท็จ
}
*/
/*ตัวอย่างที่ 1
ค่า time (20) มากกว่า 18 ดังนั้นเงื่อนไข if เป็นเท็จ
ดังนั้นเราจะไปที่เงื่อน else และแสดงข้อความ "Good evening"
ถ้าค่า time น้อยกว่า 18 โปรแกรมจะแสดงข้อความ "Good day"*/
func main() {
	time := 20        //กำหนดค่าเริ่มต้นให้กับตัวแปร time ซึ่งคือ 20
	temperature := 14 //กำหนดค่าเริ่มต้นตัวแปร temperature ซึ่งคือ 14
	if time < 18 {    //เงื่อนไขจริงพิมพ์ข้อความ "Good day"
		f.Println("Good day.")
	} else { //เงื่อนไขเท็จพิมพ์ข้อความ "Good Evening"
		f.Println("Good Evening")
	}

	/*ตัวอย่างที่ 2
	ค่า temperature เท่ากับ 14 ดังนั้นเงื่อนไขสำหรับ
	if เป็นเท็จ ทำให้โค้ดภายในคำสั่ง else ถูกดำเนินการ
	*/
	if temperature > 15 { //เงื่อนไขเป็นจริงพิมพ์ข้อความ "ข้างนอกมันอุ่น"
		f.Println("ข้างนอกมันอุ่น")
	} else { //เงื่อนไขเป็นเท็จพิมพ์ข้อความ "ข้างนอกมันเย็น"
		f.Println("ข้างในมันเย็น")
	}
}

/*อธิบายโค้ด
ตัวอย่างที่ 1 เรากำหนดค่าเริ่มต้นตัวแปร time เท่ากับ 20 และตรวจสอบว่า
time น้อยกว่า 18 หรือไม่ ถ้าเงื่อนไขเป็นจริง จะแสดงข้อความ "Good day"
แต่ถ้าเงื่อนไขเป็นเทจ จะแสดงข้อความ "Good evening"
ในกรณีนี้ 20 มากกว่า 18 ดังนั้นจะแสดง "Good evening"

ตัวอย่างที่ 2 เรากำหนดค่าเริ่มต้นตัวแปร temperature เท่ากับ 14
และตรวจสอบว่า temperature มากกว่า 15 หรือไม่ ถ้า
เงื่อนไขเป็นจริง จะแสดงข้อความ "ข้างนอกมันอุ่น" แต่ถ้าเงื่อนไขเป็นเท็จ
จะแสดงข้อความ "ข้างในมันเย็น" ในกรณีนี้ 14 น้อยกว่า 15 ดังนั้นจะแสดง
"ข้างในมันเย็น"
*/
