package main

/* ตัวดำเนินการตรรกะ (Logical Operators)
ตัวดำเนินการตรรกะใช้สำหรับการกำหนดตรรกะระหว่างตัวแปรหรือค่าต่างๆ

*ตัวดำเนินการตรรกะเหล่านี้มักใช้ในการเปรียบเทียบเงื่อนไขและการตัดสินใจในโปรแกรม
*เช่นใช้ในคำสั่ง if, for, loop หรือในเงื่อนไขทางตรรกะอื่นๆ

Operator      Name       		Description						  			Example
&&			  Logical and	 	คืนค่า true ถ้าทั้งสองคำสั่งเป็น true	  		    x < 5 && x < 10
||			  Logical OR		คืนค่า true ถ้ามีอย่างน้อยหนึ่งคำสั่งที่เป็น true       x < 5 || x < 4
!			  Logical not		กลับด้านผลลัพธ์ คืนค่า false ถ้าผลลัพธ์เป็น true	!(x < 5 && x < 10)

ตัวดำเนินการ && (logical and) จะคืนค่า true เมื่อทั้งสองเงื่อนไขเป็นจริง
ในขณะที่ || (logical or) จะคืนค่า true เมื่อมีอย่างน้อยหนึ่งเงื่อนไขเป็นจริง
ตัวดำเนินการ ! (logical not) จะกลับด้านผลลัพธ์ที่ได้จากเงื่อนไขที่ใช้เปรียบเทียบ





*/
