package main

import (
	f "fmt"
)

// เรียกใช้งาน keyword var ประกาศตัวแปรพร้อมระบุชนิดข้อมูล
// การใช้ var ด้วยวงเล็บเปิด-ปิด () เพื่อจัดกลุ่มตัวแปรดูง่ายและชัดเจนขึ้น
var (
	num1, num2 float64 //ตัวแปร num1 และตัวแปร num2 ชนิด float64
	operator   string  //ตัวแปร operator ชนิด string
	result     float64 //ตัวแปร result ชนิด float64
)

func main() {
	// ประกาศฟังก์ชัน Println() พิมพ์ข้อความที่เรากำหนด ออกจอภาพ
	f.Println("ใส่หมายเลขแรก: ")
	f.Scanln(&num1) //ประกาศฟังก์ชัน Scanln() รับค่าข้อมูลที่ป้อนจากฟังก์ชัน Println() โดยใช้เครื่องหมาย & ส่งค่าให้ตัวแปร num1
	f.Println("ใส่หมายเลขสอง: ")
	f.Scanln(&num2) //ประกาศฟังก์ชัน Scanln() รับค่าข้อมูลที่ป้อนจากฟังก์ชัน Println() โดยใช้เครื่องหมาย & ส่งค่าให้ตัวแปร num2
	f.Println("ป้อนตัวดำเนินการ (+, -, *, /): ")
	f.Scanln(&operator) //ประกาศฟังก์ชัน Scanln() รับค่าข้อมูลที่ป้อนจากฟังก์ชัน Println() โดยใช้เครื่องหมาย & ส่งค่าให้ตัวแปร operator

	switch operator { //เงื่อนไขตรวจสอบตัวแปร operator ที่รับค่าข้อมูลที่ป้อนจากฟังก์ชัน Println()
	case "+": //ถ้าเป็น +
		result = num1 + num2 //ก็จะเรียกใช้งานตัวแปร result รับค่าข้อมูลการคำนวณของ num1 + num2
	case "-": //ถ้าเป็น -
		result = num1 - num2 //ก็จะเรียกใช้งานตัวแปร result รับค่าข้อมูลการคำนวณของ num1 - num2
	case "*": //ถ้าเป็น *
		result = num1 * num2 //ก็จะเรียกใช้งานตัวแปร result รับค่าข้อมูลการคำนวณของ num1 * num2
	case "/": //ถ้าเป็น /
		result = num1 / num2 //ก็จะเรียกใช้งานตัวแปร result รับค่าข้อมูลการคำนวณของ num1 / num2
	default: //เงืื่อนไขตรวจสอบตัวเนินการ + - * / ผิดหรือไม่
		f.Println("ตัวดำเนินการไม่ถูกต้อง") //ถ้าผิดแสดงผลข้อความออกจอภาพและจบโปรแกรม
		return                              //คืนค่าผลลัพธ์ ไม่ระบุตัวแปร
	}

	//ประกาศฟังก์ชัน Printf() พิมพ์ค่าข้อมูลในตัวแปร num1, operator, num2, result,
	f.Printf("%.2f %s %.2f = %.2f\n", num1, operator, num2, result)
	// %.2f แสดงผลค่าของตัวแปร num1 โดยมีจุดทดศนิยม (.)
	// %s   แสดงผลค่าของตัวแปร Operator ซึ่งคือ + - * /
	// %.2f แสดงผลค่าของตัวแปร num2 โดยมีจุดทศนิยม (.)
	// %.2f แสดงผลลัพธ์ของตัวแปร result โดยมีจุดทศนิยม (.)
}
