package main

import (
	f "fmt"
)

// ประกาศตัวแปรนอกฟังก์ชัน
var j, k = 6, "hello"
var (
	a int = 1 // ประกาศตัวแปรแต่ละตัวทีละบรรทัดเมื่อระบุประเภท
	b int = 2
	c int = 3
)

// ประกาศตัวแปรในบรรทัดเดียว var a, b, c int = 1, 2, 3
/*ประกาศตัวแปรหลายบรรทัด
var (
    d int = 4 // ต้องประกาศทีละบรรทัดเมื่อระบุประเภท
    e int = 5
    f int = 6
)*/
//ตัวอย่างโปรแกรมที่สมบูรณ์
//ประกาศตัวแปรภายในฟังก์ชัน ใช้ :=
func main() {
	var m, l = 15, "Go"                        // ประกาศตัวแปร m และ l โดยไม่ระบุประเภท (Go จะกำหนดประเภทให้โดยอัตโนมัติ)
	z, v := 17, "Lang!"                        // ประกาศตัวแปร z และ v พร้อมกำหนดค่าเริ่มต้นโดยใช้ :=
	n, d := 7, "World"                         //ตัวแปร n Go ได้กำหนดประเภทข้อมูลเป็น int ส่วน d ประเภทข้อมูลเป็น String
	f.Println(a, b, c, j, k, n, d, m, l, z, v) //ตัวอย่างการใช้ปริ้นหลายตัวแปรในบรรทัดเดียว
}

/*ตัวอย่างการประกาศที่ผิดพลาด:
var a int, b string = 1, "hello" // ผิดพลาด เนื่องจากระบุประเภทต่างกันในบรรทัดเดียวกัน
*/

/*การประกาศตัวแปรหลายตัวในบรรทัดเดียว:
var a, b, c int = 1, 2, 3 - สามารถทำได้เมื่อทุกตัวแปรมีประเภทเดียวกัน
*/
/*
การประกาศตัวแปรหลายตัวในบรรทัดแยก:
var ( d int = 4 e int = 5 f int = 6 ) - ต้องประกาศแยกกันในแต่ละบรรทัดเมื่อระบุประเภท
*/
