package main

import (
	f "fmt"
)

//วิธีที่ 2 การใช้เครื่องหมาย :=
/* Array Syntax How to use?
array_name := [length]datatype{values}
*/
func main() {
	//เครื่องหมาย := ประกาศได้แค่ในฟังก์ชัน
	//การประกาศ array โดยกำหนดขนาดใช้เครื่องหมาย :=
	arr1 := [5]int{1, 2, 3, 4, 5}
	//การประกาศ array โดยให้ Go คำนวณขนาดเอง
	arr2 := [...]int{6, 7, 8, 9, 10}
	//พิมพ์ค่าขนาดข้อมูลของ array ซึ่งคือ 5
	f.Println(arr1) //ผลลัพธ์ [1 2 3 4 5]

	//Go จะคำนวณขนาดของ array จากจำนวนค่าที่กำหนด ซึ่งคือ 5
	f.Println(arr2) //ผลลัพธ์ [6 7 8 9 10]

	//พิมพ์ค่าการเข้าถึงขนาดข้อมูลของ array ซึ่งคือ 2
	f.Println(arr2[2]) //ผลลัพธ์ 8

}
