package main

import (
	f "fmt"
)

/*
ประเภทข้อมูลจำนวนเต็มถูกใช้ในการ
เก็บค่าจำนวนเต็มที่ไม่มีทศนิยม เช่น 35, -50, หรือ 1345000
*/
/*
1.จำนวนเต็มแบบมีเครื่องหมาย (Signed integers) - สามารถเก็บได้ทั้งค่าบวกและค่าลบ
2.จำนวนเต็มแบบไม่มีเครื่องหมาย (Unsigned integers) - สามารถเก็บได้เฉพาะค่าที่ไม่เป็นลบ (บวกและศูนย์เท่านั้น)
*/
var x int = 500   // จำนวนเต็มบวก
var y int = -4500 // จำนวนเต็มลบ
var a uint = 600
var s uint = 4600

func main() {
	f.Printf("Type: %T, value: %v\n", x, x) //ผลลัพธ์: Type: int, value: 500
	f.Printf("Type: %T, value: %v\n", y, y) //ผลลัพธ์: Type: int, value: -4500
	f.Printf("Type: %T, value: %v\n", a, a) //ผลลัพธ์: Type: uint, value: 600
	f.Printf("Type: %T, value: %v\n", s, s) //ผลลัพธ์: Type: uint, value: 4600
}

/*
ฟังก์ชัน fmt.Printf ถูกใช้ในการแสดงประเภทข้อมูลและค่าของตัวแปร
%T เป็นเวิร์บที่ใช้ในการแสดงประเภทข้อมูลของตัวแปร
%v เป็นเวิร์บที่ใช้ในการแสดงค่าของตัวแปร
*/
