package main

import f "fmt"

/*
การประกาศ array มีสองวิธีหลัก ๆ คือการใช้คำสั่ง var และการใช้เครื่องหมาย :=
แต่ละวิธีสามารถกำหนดขนาดของ array ได้ทั้งแบบ
กำหนดขนาดโดยตรงและแบบให้ Go คำนวณขนาดเองจากจำนวนค่าที่กำหนด
*/
// 			 วิธีที่ 1 การใช้คำสั่ง var
// การประกาศ array โดยกำหนดขนาด ตัวอย่าง syntax
// var array_name = [length]datatype{values}
/* array_name คือชื่อของ array
   [length] คือขนาดของ array (จำนวนตำแหน่งที่ array สามารถเก็บค่าได้)
   datatype คือชนิดของข้อมูลใน array
   {values} คือค่าที่กำหนดให้กับ array
*/
var numbers1 = [5]int{1, 2, 3, 4, 5}

// การประกาศ array โดยให้ Go คำนวณขนาดเอง
// var array_name = [...]datatype{values}
// ในกรณีนี้, ขนาดของ array จะถูกกำหนดโดยจำนวนค่าที่กำหนดใน {values}
// ในตัวอย่างนี้ Go จะคำนวณขนาดของ array จากจำนวนค่าที่กำหนด ซึ่งคือ 5
var numbers2 = [...]int{6, 7, 8, 9, 10}

func main() {
	//พิมพ์ค่าขนาดข้อมูลของ array ซึ่งคือ 5
	f.Println(numbers1) // ผลลัพธ์ [1 2 3 4 5]
	//Go จะคำนวณขนาดของ array จากจำนวนค่าที่กำหนด ซึ่งคือ 5
	f.Println(numbers2) // ผลลัพธ์ [6 7 8 9 10]
}
