package main

import (
	f "fmt"
)

// การอัปเดตและเพิ่มค่าสมาชิกใน map
// การอัปเดตหรือเพิ่มสมาชิกนแผนที่ทำได้โดยการาระบุคีย์และค่าที่ต้องการ
// Syntax map_name[key] = value
/* map_name คือ ชื่อของ Map
   key คือ คีย์ที่ต้องการใช้ระบุสมาชิก
   value คือ ค่าที่ต้องการกำหนดให้กับคีย์นั้น
*/
// เรียกใช้ฟังก์ชัน make() เพื่อสร้าง map empty ให้ตัวแปร a ชนิดข้อมูล string:string
var a = make(map[string]string)

func main() {
	// การเพิ่มคีย์และค่าเข้าไปใน map
	a["brand"] = "Ford"
	a["model"] = "Mustang"
	a["year"] = "1964"
	//ใช้คีย์เพื่อเพิ่มค่าลงในแผนที่ ตัวอย่างเช่น a["brand"] = "Ford" จะเพิ่มคีย์ "brand" และค่าของมันคือ "Ford"
	f.Println(a) // พิมพ์ค่าใน map ออกจอภาพ

	// การอัปเดตสมาชิกใน map
	a["year"] = "1970" // การอัปเดตสมาชิกใน map
	a["color"] = "red" // การเพิ่มสมาชิกใหม่ใน map
	f.Println(a)       // หลังจากอัปเดตและเพิ่มสมาชิก พิมพ์ค่าใน map ออกจอภาพ
}

/* Note:
การอัปเดตสมาชิกใน map ทำได้โดยการระบุคีย์ที่ต้องการอัปเดตและกำหนดค่าใหม่
การเพิ่มสมาชิกใหม่ใน map ทำได้โดยการระบุคีย์ใหม่และกำหนดค่าให้กับคีย์นั้น
map ใน Go จะจัดเก็บข้อมูลในรูปแบบที่ไม่เป็นลำดับเพื่อให้การค้นหามีประสิทธิภาพสูงสุด
*/
