package main //package หลักของโปรแกรม

import (
	f "fmt" //นำเข้าแพ็กเกจ fmt
)

/*ในภาษา Go เราสามารถกำหนดค่าเริ่มต้นให้กลับสมาชิก เฉพาะใน array ได้
โดยใช้รูปแบบการระบุค่าในรูปแบบ index:value ซึ่งช่วยให้เรากำหนดค่าเฉพาะสมาชิก
ที่่ต้องการ ในขณะที่สมาชิกที่เหลือจะถูกกำหดค่าเฉพาะสมาชิกที่เหลือ
จะถูกกำหนดเป็นค่าพื้นฐานของชนิดข้อมูลนั้นๆ
*/
/*
การกำหนดค่าเริ่มเฉพาะสมาชิกใน array
เพื่อกำหนดค่าเริ่มต้นให้กับสมาชิกเฉพาะใน array ให้ใช้รูปแบบ
index:value ภายในวงเล็บปีกกาหลังชื่อ array
*/
//การกำหนดค่าเริ่มต้นเฉพาะสมาชิกตัวที่สองและตัวที่สาม
//ฟังก์ชันหลัก
//การประกาศและกำหนดค่าเริ่มต้นให้กับ array
//     index:value Syntax how to use ?
func main() {
	//1: 10 กำหนดให้สมาชิกที่ดัชนี 1 (สมาชิกตัวที่สอง)มีค่าเป็น 10
	//2: 40 กำหนดให้สมาชิกที่ดัชนี 2 (สมาชิกตัวที่สาม)มีค่าเป็น 40
	arr1 := [5]int{1: 10, 2: 40} //กำหนดค่าเฉพาะสมาชิกตัวที่สองและตัวที่สาม
	f.Println(arr1)              // พิมพ์ค่าใน arr1
	//สมาชิกตัวที่เหลือ(ดัชนี 0, 3, และ 4 ) จะถูกกำหนดเป็นค่าพื้นฐานของชนิดข้อมูล int ซึ่งคือ 0
}

/*
 สรุป
การกำหนดค่าเริ่มต้นให้กับสมาชิกเฉพาะใน array ในภาษา Go ทำได้โดยใช้รูปแบบ index:value
สิ่งนี้ช่วยให้เรากำหนดค่าให้กับสมาชิกที่ต้องการเท่านั้น
ในขณะที่สมาชิกที่เหลือจะถูกกำหนดเป็นค่าพื้นฐานของชนิดข้อมูลนั้นๆ ซึ่งเป็นวิธีที่มีประโยชน์
ในการจัดการ array ที่มีขนาดใหญ่และต้องการกำหนดค่าให้กับสมาชิกเฉพาะ
*/
