package main

import (
	f "fmt"
	"time"
)

/* นำเข้าแพ็กเกจ fmt เพื่อใช้ในการพิมพ์ข้อความลงในจอภาพ
   นำเข้าแพ็กเก็จ time เพื่อใช้ในการจัดการวันและเวลา
*/
/*
	การใช้งานฟังก์ชัน Switch โดยไม่มีเงื่อนไข ก็เหมือนกับ switch true นั่นเอง
	รูปแบบนี้ดูง่ายกว่าการเขียน if-then-else ต่อกันหลายๆชั้น
*/
func main() {
	// ประกาศตัวแปร t และเก็บเวลาปัจจุบัน
	t := time.Now() // ประกาศตัวแปร t เป็นตัวแปรที่เก็บค่าเวลาในปัจจุบันโดยใช้ฟังก์ชัน time.Now() ซึ่งคืนค่าเป็นชนิด time.Time
	switch {        // ประกาศฟังก์ชัน switch ไม่มีเงื่อนไข
	// ประกาศฟังก์ชัน t.hour() คืนค่าชั่วโมงในเวลาปัจจุบันในรูปแบบตัวเลขตั้งแต่ 0 ถึง 23
	case t.Hour() < 12: // ตรวจสอบเงื่อนไขถ้าเวลาปัจจุบันก่อนเที่ยง 12.00 ถ้าเป็นจริงจะพิมพ์ข้อความ สวัสดีตอนเช้า
		f.Println("สวัสดีตอนเช้า")
	case t.Hour() < 17: // ตรวจสอบเงื่อนไขถ้าเวลาปัจจุบันก่อนห้าโมงเย็น 17.00 แต่หลังจากเที่ยง ถ้าเป็นจริงจะพิมพ์ข้อความ สวัสดีตอนบ่าย
		f.Println("สวัสดีตอนบ่าย")
	default: // ถ้าไม่มีเงื่อนไข case ไหนที่เป็นจริงจะทำงานที่ default และพิมพ์ข้อความ สวัสดีตอนเย็น
		f.Println("สวัสดีตอนเย็น")
	}
} /* Note: switch ที่ไม่มีเงื่อนไขจะทำงานในลักษณะเหมือน switch true ซึ่งหมายถึงจะพิจารณาเงื่อนไข case
แต่ละตัวจากบนลงล่างจนกว่าจะพบเงื่อนไขที่เป็นจริง
t : คือ ชื่อพารามิเตอร์ในฟังก์ชัน
*/
/*สรุป
โปรแกรมนี้ใช้ switch ที่ไม่มีเงื่อนไขเพื่อเขียนโค้ดในลักษณะคล้ายกับ if-then-else หลายๆ ชั้น
โดยจะพิจาณาเงื่อนไขต่างๆ ของเวลาในปัจจุบันและพิมพ์ข้อความที่เหมาะสมกับช่วงเวลานั้น
- ถ้าเป็นเวลาก่อนเที่ยง จะพิพม์ข้อความ สวัสดีตอนเช้า
- ถ้าเป็นเวลาหลังเเที่ยงแต่ก่อนห้าโมงเย็น จะพิมพ์ข้อความ สวัสดีตอนบ่าย
- ถ้าเป็นเวลาเย็นหรือหลังห้าโมงเย็น จะพิมพ์ข้อความ สวัสดีตอนเย็น
โปรแกรมนี้ช่วยให้จัดการหลายเงื่อนไขทำได้อย่างเป็นระเบียบและอ่านง่ายขึ้นกว่าใช้ if-then-else หลายๆ ชั้น
*/
