package main

import (
	f "fmt"
	"runtime"
) /* นำเข้าแพ็กเก็จ "fmt" สำหรับฟังก์ชันการจัดการอินพุตและเอาท์พุต
และแพ็กเกจ runtime สำหรับข้อมูลเกี่ยวกับ runtime environment เช่น ชนิดของ OS
*/

/*
โค้ดนี้ใช้ในการพิมพ์ข้อความที่บอกว่าภาษา Go กำลังทำงานอยู่บนระบบปฏิบัติการใด โดยใช้คำสั่ง switch
เพื่อเช็คชนิดของระบบปฏิบัติการ (OS) ที่โปรแกรมกำลังรันอยู่
*/
func main() {
	f.Print("Go runs on ") // พิมพ์ข้อความ "Go runs on" โดยไม่ขึ้นบรรทัดใหม่
	// ใช้คำสั่ง switch เพื่อตรวจสอบค่าของ runtime.GOOS ซึ่งเป็นตัวแปร string ที่บอกชนิดของ OS ที่โปรแกรมกำลังรันอยู่
	switch os := runtime.GOOS; os { // ประกาศตัวแปร os และกำหนดค่าเป็น runtime.GOOS
	case "darwin": // ถ้า os มีค่าเป็น darwin จะทำงานคำสั่งในบล็อกนี้
		f.Println("OS X.") // พิมพ์ข้อความ OS X.
	case "linux": // ถ้า os มีค่าเป็น linux จะทำงานคำสั่งในบล็อกนี้
		f.Println("linux") // พิมพ์ข้อความ linux
	default: // ถ้า os มีค่าอื่นที่ไม่ใช่ darwin หรือ linux จะทำงานคำสั่งในบล็อกนี้
		f.Printf("%s.\n", os) // พิมพ์ค่าของ os พร้อมด้วยจุด
	}

}

/*การทำงานของโปรแกรม
โปรแกรมนี้จะพิมพ์ข้อความที่บอกว่าภาษา Go กำลังรันอยู่บนระบบปฏิบัติการใดโดยการเช็คค่า runtime.GOOS
และเลือก case ที่ตรงกับค่า runtime.GOOS ตัวอย่างเช่น

ถ้ารันบน macOS (Darwin), ผลลัพธ์จะเป็น
Go runs on OS X.

ถ้ารันบน linux ผลลัพธ์จะเป็น
Go runs on Linux

ถ้ารันบน Windows ผลลัพธ์จะเป็น
Go runs on Windows

*/
