package main

import (
	f "fmt"
)

func main() {
	//1.การประกาศและการตั้งค่าตัวแปร
	i, j := 42, 2701 // ประกาศตัวแปร i และ j โดยให้ค่าเริ่มต้นเป็น 42 และ 2701

	//2.การสร้าง pointer และการใช้งาน
	p := &i       // ชี้ pointer ชื่อตัวแปร p ไปยังตัวแปร i
	f.Println(*p) // อ่านค่าของ i ผ่าน pointer ชื่อตัวแปร p พิมพ์ผลลัพธ์ 42

	//3.การแก้ไขค่าผ่าน pointer
	*p = 21      // เปลี่ยนค่าของ i ผ่าน pointer ชื่อตัวแปร p โดยใช้เครื่องหมายสตาร์ * เปลี่ยนค่า i เป็น 21
	f.Println(i) // แสดงค่าของ i หลังจากเปลี่ยนค่า พิมพ์ผลลัพธ์ 21

	//4.การเปลี่ยน pointer ไปชี้ที่ตัวแปรอื่นและการคำนวณผ่าน pointer
	p = &j       // ชี้ pointer ชื่อตัวแปร p ไปยังตัวแปร j
	*p = *p / 37 // หารค่าใน j ผ่าน pointer ชื่อตัวแปร p เปลี่ยนค่า j เป็น j หาร 37
	f.Println(j) // แสดงค่าของ j หลังจากเปลี่ยนค่า พิมพ์ผลลัพธ์ค่าใหม่ของ j
}

/* สรุป
การใช้ pointer ใน Go ช่วยให้โปรแกรมมีประสิทธิภาพในการจัดการหน่วยความจำ
และช่วยให้สามารถแก้ไขค่าผ่านฟังก์ชันได้อย่าง่ายดาย โค้ดตัวอย่างนี้แสดงให้เห็นการสร้าง pointer,
การใช้งาน pointer ในการอ่านและเขียนค่า และการเปลี่ยน pointer ไปชี้ที่ตัวแปรอื่น
*/
