package main

import (
	f "fmt"
)

//ฟังก์ชันการแสดงผลใน Go
/*ในภาษา Go มีฟังก์ชันสามตัวที่ใช้สำหรับ
การแสดงข้อความออกทางหน้าจอ:
1.Print()
2.Println()
3.Printf()
*/

// 1.Print()
// ใช้เพื่อแสดงผลข้อความตามรูปแบบเริ่มต้นของอาร์กิวเมนต์ที่ถูกส่งเข้าไป
var i, j string = "Dev", "Programing" //var ใช้ได้ทั้งในและนอกฟังก์ชัน
// ตัวแปร i และ j ถูกประกาศเป็นชนิดข้อมูล string โดย i มีค่าเริ่มต้นเป็น Hello
// และ j มีค่าเริ่มต้นเป็น World
func main() {
	f.Print(i)
	f.Print(j)
	f.Print(i, j) //ปริ้นหลายตัวแปรในบรรทัดเดียว
	//ฟังก์ชัน fmt.Print() ใช้เพื่อพิมพ์ค่าของ i และ j
	//ต่อกันโดยไม่มีช่องว่างระหว่างค่าทั้งสอง
}

/*
ฟังก์ชัน Print() จะแสดงผลอาร์กิวเมนต์ที่ถูกส่งเข้าไปโดยไม่มีการเพิ่มช่องว่างหรือบรรทัดใหม่อัตโนมัติ
ทำให้ค่าที่พิมพ์ออกมาต่อกันบนบรรทัดเดียวกัน
*/
