package main

import (
	f "fmt"
)

/*การจัดเก็บค่าที่คืนจากฟังก์ชันในตัวแปร
การจัดเก็บค่าที่คืนในตัวแปร เราสามารถจัดเก็บค่าทืี่คืนจากฟังก์ชันในตัวแปรได้ โดย
ทำตามโค้ดตัวอย่างนี้ */
/*โค้ดตัวอย่างนี้ เราจัดเก็บค่าที่คืนจากฟังก์ชันในตัวแปรชื่อว่า total*/

// การสร้างฟังก์ชัน (Function Creation)
// ประกาศฟังก์ชัน ชื่อ myFunction() กำหนดค่าพารามิเตอร์ 2 ตัว ชื่อ x และ y ชนิด int
// กำหนดพารามิเตอร์คืนค่าชื่อ result ชนิดข้อมูล int
func myFunction(x int, y int) (result int) {
	result = x + y //เรียกใช้พารามิเตอร์คืนค่าชื่อ result รับคืนค่าผลรวม x + y
	return         //ประกาศฟังก์ชัน return ไม่ระบุตัวแปรที่จะคืนค่า ส่งค่า result ออกไปให้ฟังก์ชัน
}

// การเรียกใช้ฟังก์ชันและจัดเก็บค่าที่่คืน (Function Call and Storing Return Value)
func main() {
	//เรียกใช้ฟังก์ชันชื่อ myFunction() โดยส่งค่า 1, 2 เป็นอาร์กิวเมนต์
	total := myFunction(1, 2) //จัดเก็บค่าที่คืนจากฟังก์ชันในตัวแปร ชื่อ total
	f.Println(total)          //พิมพ์ผลออกจอภาพ
}

/*อธิบายโค้ด
1.ฟังก์ชัน myFunction รับค่าพารามิเตอร์สองค่า คือ x และ y (ทั้งคู่เป็นชนิด int)
ฟังก์ชันคืนค่าผลรวมของ x และ y โดยใช้ตัวแปร result ที่เป็นชนิด int

2.ในฟังก์ชัน main เราเรียกใช้ myFunction โดยส่งค่า 1 และ 2 เป็นอาร์กิวเมนต์
ค่าที่คืนจาก myFunction จะถูกจัดเก็บในตัวแปร total
จากนั้นเราพิ่มพ์ค่าของ total ด้วยคำสั่ง f.Println
*/
/*สรุป
- ทำให้โค้ดอ่านง่ายและชัดเจนขึ้น
- สามารถนำค่าที่คืนไปใช้งานต่อในส่วนอื่นๆ ของโปรแกรมได้
- เพิ่มความสามารถในการตรวจสอบและดีบักค่าที่คืนจากฟังก์ชัน
*/
