package main

import (
	f "fmt"
)

/*
การจัดรูปแบบสำหรับข้อมูลชนิดสตริง
(String Formatting Verbs) ใน Go
*/
func main() {
	txt := "Hello"
	// พิมพ์ค่าเป็นสตริงโดยตรง
	f.Printf("%s\n", txt) // Hello
	// พิมพ์ค่าเป็นสตริงที่มีเครื่องหมายคำพูดคู่
	f.Printf("%q\n", txt) // "Hello"
	// พิมพ์ค่าเป็นสตริงโดยตรง (ความกว้าง 8 ตัวอักษร,จัดตำแหน่งทางขวา)
	f.Printf("%8s\n", txt) //    Hello
	// พิมพ์ค่าเป็นสตริงโดยตรง (ความกว้าง 8 ตัวอักษร, จัดตำแหน่งทางซ้าย)
	f.Printf("%-8s\n", txt) // Hello
	// พิมพ์ค่าเป็น hex dump ของค่า byte ภายในสตริง
	f.Printf("%x\n", txt) // 48656c6c6f
	// พิมพ์ค่าเป็น hex dump ของค่า byte ภายในสตริงพร้อมเว้นวรรค
	f.Printf("% x\n", txt) // 48 65 6c 6c 6f
}

/*
	การใช้งานเวิร์บการจัดรูปแบบสำหรับสตริงใน Go
	ช่วยให้เราสามารถกำหนดรูปแบบการแสดงผลของข้อมูลสตริงให้เหมาะสมกับ
	ความต้องการและการอ่านข้อมูลที่เข้าใจง่ายขึ้นได้
*/
