package main

import (
	f "fmt"
)

/*
ในภาษา Go (Golang) ความยาวของ array ถูกกำหนดไว้อย่าง
ชัดเจนและไม่สามารถเปลี่ยนแปลงได้หลังจากการประกาศ array นั้นๆ
ความยาวของ array สามารถกำหนดได้สองวิธี คือ
การกำหนดโดยตรง (defined) หรือให้คอมไพเลอร์ตัดสินใจ
จากจำนวนค่าที่กำหนด (inferred)
*/
/* 		ความยาวของ Array
1.ความยาวที่กำหนดโดยตรง(Defined Length)
เมื่อประกาศ array โดยการระบุจำนวนที่แน่นอนในวงเล็บสี่เหลี่ยม
เช่น [3]int{1,2,3}, ความยาวของ array จะถูกกำหนดเป็น 3
2.ความยาวที่ให้คอมไพเลอร์ตัดสินใจ(Inferred Length)
เมื่อประกาศ array โดยไม่ระบุจำนวนในวงเล็บสี่เหลี่ยม แต่ใช้
เครื่องหมายจุดสามจุดแทน เช่น [...]int{1,2,3} ความยาวของ array
จะถูกกำหนดโดยจำนวนค่าที่กำหนด ซึ่งในกรณีนี้จะเป็น 3
*/
//การประกาศ array สองตัว (arr1 และ arr2)
//โดยการกำหนดความยาวอย่างชัดเจน
var arr1 = [3]int{1, 2, 3} // ประกาศ arr1 ด้วยความยาว 3 และกำหนดค่าเริ่มต้น

func main() {

	arr2 := [5]int{4, 5, 6, 7, 8} // ประกาศ arr2 ด้วยความยาว 5 และกำหนดค่าเริ่มต้น
	f.Println(arr1)               //พิมพ์ค่าใน arr1
	f.Println(arr2)               // พิมพ์ค่าใน arr2
}

/*
สรุป
การประกาศ array ใน Go
สามารถกำหนดความยาวได้โดยตรงหรือ
ให้คอมไพเลอร์ตัดสินใจจากจำนวนค่าที่กำหนด ความยาวของ array
เป็นค่าคงที่และไม่สามารถเปลี่ยนแปลงได้หลังจากการประกาศ
การประกาศ array โดยใช้ var หรือ :=
สามารถทำได้ทั้งสองวิธีตามความสะดวก
*/
