package main

import (
	f "fmt"
)

/*
คำสำคัญ float32
float32 เป็นประเภทข้อมูลใน Go ที่ใช้สำหรับเก็บค่าตัวเลขที่มีจุดทศนิยม โดยมีขนาด 32
บิตและสามารถเก็บค่าได้ตั้งแต่ -3.4e+38 ถึง 3.4e+38
*/
var a float32 = 123.78
var b float32 = 3.4e+38
var c = 789.1011 //ค่าเริ่มต้นคือ float64
func main() {
	f.Printf("Type: %T, value: %v\n", a, a)
	f.Printf("Type: %T, value: %v\n", b, b)
	f.Printf("Type: %T, value: %v", c, c)
}

/*
ตัวแปร x ถูกประกาศเป็นชนิด float32 และกำหนดค่าเป็น 123.78
ตัวแปร y ถูกประกาศเป็นชนิด float32 และกำหนดค่าเป็น 3.4e+38
ซึ่งเป็นค่าในรูปแบบวิทยาศาสตร์ (Scientific Notation)
*/
/*
ฟังก์ชัน fmt.Printf ถูกใช้เพื่อพิมพ์ชนิดและค่าของตัวแปรโดยใช้ตัวแปรรูปแบบ (format specifier)
%T เพื่อพิมพ์ชนิดของตัวแปร และ %v เพื่อพิมพ์ค่าของตัวแปร
*/
