package main

import (
	f "fmt"
)

// Go For Loops
/* ในภาษา Go คำสั่ง for ใช้สำหรับการวนลูปโค้ดบล็อกซ้ำๆ ตามจำนวนครั้งที่กำหนด
for เป็นลูปเดียวที่มีในภาษา Go*/
/*Syntax for statement1; statement2; statement3{
	โค้ดที่จะถูกเรียกใช้ในแต่ละรอบของการวนลูป
 }
	statement1 ใช้ในการกำหนดค่าเริ่มต้นให้กับตัวนับลูป
	statement2 จะถูกประเมินในแต่ละรอบของการวนลูป ถ้าผลลัพธ์เป็น TRUE
	ลูปจะดำเนินการต่อไป ถ้าผลลัพธ์เป็น false ลูปจะสิ้นสุด
	statement3 ใช้ในการเพิ่มค่าตัวนับลูป
// Note: คำสั่งเหล่านี้ไม่จำเป็นต้องอยู่ในอาร์กิวเมนต์ของลูปแต่อาจต้องมีอยู่ในโค้ด
ในบางรูปแบบ
*/
//ตัวอย่างการใช้ for Loop ตัวอย่างนี้จะแสดงเลขจาก 0 ถึง 4
func main() {
	for i := 0; i < 5; i++ {
		f.Println(i)
	} //i = index
}

/*อธิบายโค้ด
i := 0; กำหนดค่าตัวนับลูป (i) และตั้งค่าเริ่มต้นเป็น 0
i < 5; ดำเนินการวนลูปต่อเมื่อ i น้อยกว่า 5
i++ เพิ่มค่าตัวนับลูปทีละ 1 ในแต่ละรอบ
*/
