package main

import (
	f "fmt"
) //การนำเข้าแพคเกจ

// การประกาศค่าคงที่หลายตัว
// การประกาศค่าคงที่หลายตัวสามารถจัดกลุ่มรวมกันในบล็อกเดียว
const ( //การประกาศค่าคงที่ในบล็อก
	A int = 1     // type int
	B     = 3.14  // type float64
	C     = "Hi!" // type string
) //การใช้เครื่องหมายวงเล็บ () เพื่อประกาศค่าคงที่หลายตัวในบล็อกเดียว
// ฟังก์ชัน main เป็นจุดเริ่มต้นของการทำงานในโปรแกรม Go
func main() {
	f.Println(A)
	f.Println(B)
	f.Println(C) //แสดงผลลัพธ์ออกหน้าจอ 1 3.14 Hi!
}

/*
การประกาศค่าคงที่หลายตัวในบล็อกเดียวช่วยให้โค้ดอ่านง่ายและจัดระเบียบดีขึ้น
โดยค่าคงที่แต่ละตัวสามารถประกาศพร้อมค่าของมันได้อย่างชัดเจนในบล็อกเดียว
*/
